//******************************************************************************
//	ファイル名	：	GameOver.cpp
//	作成者		：	kageyama taiki
//	作成日		：	2011/09/23
//	機能		：	ゲームオーバー
//------------------------------------------------------------------------------
//	更新履歴	：	
//
//******************************************************************************
//------------------------------------------------------------
//	呼ばなければいけないヘッダ
//------------------------------------------------------------
#include	"GameOver.h"
//------------------------------------------------------------
//	呼びたいヘッダ
//------------------------------------------------------------
#include	"GameOverBack.h"
#include	"GameOverSystem.h"
#include	"GameOverUnder.h"
//------------------------------------------------------------
//	変数や宣言
//------------------------------------------------------------
using namespace gameover;
//------------------------------------------------------------
//	コンストラクタ
//------------------------------------------------------------
C_GameOver::C_GameOver()
{
	mObj.resize(OBJ_MAX);	//最初に使用するだけ生成数を設定しておく

	//以下に最初に生成しておきたいオブジェクトを入れる
	C_Base*  b = new C_Back("res/txt/gameover/back.txt");
	SET_OBJECT(b,OBJ_BACK);
	b = new C_Under("res/txt/gameover/system.txt");
	SET_OBJECT(b,OBJ_UNDER);
	b = new C_System("res/txt/gameover/system.txt");
	SET_OBJECT(b,OBJ_SYSTEM);
	//以上

	OutputDebugString("constructor:C_GameOver\n");
}

//------------------------------------------------------------
//	デストラクタ
//------------------------------------------------------------
C_GameOver::~C_GameOver()
{
	OutputDebugString("destructor:C_GameOver\n");
}

//------------------------------------------------------------
//	描画
//------------------------------------------------------------
void C_GameOver::Draw()
{
	GetDraw();
	//Draw_TextXY(WINW / 2,WINH / 2,"GAMEOVER",0xffff0000);
}

//------------------------------------------------------------
//	制御
//------------------------------------------------------------
void C_GameOver::Control()
{
	GetControl();
}

