//******************************************************************************
//	ファイル名	：	ClearSystem.cpp
//	作成者		：	kageyama taiki
//	作成日		：	2011/10/28
//	機能		：	システム管理
//------------------------------------------------------------------------------
//	更新履歴	：	
//
//******************************************************************************
//------------------------------------------------------------
//	呼ばなければいけないヘッダ
//------------------------------------------------------------
#include	"Clear.h"
#include	"ClearSystem.h"
#include	"../Sound.h"
//------------------------------------------------------------
//	呼びたいヘッダ
//------------------------------------------------------------
//------------------------------------------------------------
//	変数や宣言
//------------------------------------------------------------
using namespace clear;
//------------------------------------------------------------
//	コンストラクタ
//------------------------------------------------------------
C_System::C_System(const char* fileName) : C_Base(fileName)
 {
	//SetPlay_Se(SE_GAMECLEAR);
	mFadeF = false;
	GetNowSelectF = false;
	mImage = C_BaseManager::SetLoadImage(mImageFileName.c_str());

	OutputDebugString("constructor:C_System\n");
}

//------------------------------------------------------------
//	デストラクタ
//------------------------------------------------------------
C_System::~C_System()
{
	OutputDebugString("destructor:C_System\n");
}

//------------------------------------------------------------
//	描画
//------------------------------------------------------------
void C_System::Draw()
{
	GetDraw_TpBitmap();
}

//------------------------------------------------------------
//	制御
//------------------------------------------------------------
bool C_System::Control()
{
	if(!GetNowSelectF && CheckPush(KEY_SPACE) && !mFadeF)
	{
		mFadeF = true;
		//SetPlay_Se(SE_SELECT2);
	}

	if(mFadeF){
		if(IsFade(C_Base::FADE_IN)){
			//SetStop_Se(SE_GAMECLEAR);
			//C_BaseScreen::SetScreenNo(C_BaseScreen::STAFFROLL_SCREEN);
				
		}	
	}
	return false;
}