//******************************************************************************
//	ファイル名	：	TitleUnder.cpp
//	作成者		：	kageyama taiki
//	作成日		：	2011/11/08
//	機能		：	操作説明
//------------------------------------------------------------------------------
//	更新履歴	：	
//
//******************************************************************************
//------------------------------------------------------------
//	呼ばなければいけないヘッダ
//------------------------------------------------------------
#include	"Title.h"
#include	"TitleUnder.h"
//------------------------------------------------------------
//	呼びたいヘッダ
//------------------------------------------------------------
#include	"TitleSelect.h"
//------------------------------------------------------------
//	変数や宣言
//------------------------------------------------------------
using namespace title;
//------------------------------------------------------------
//	コンストラクタ
//------------------------------------------------------------
C_Under::C_Under(const char* fileName) : C_Base(fileName)
 {
	mImage = C_BaseManager::SetLoadImage(mImageFileName.c_str());

	OutputDebugString("constructor:C_Under\n");
}

//------------------------------------------------------------
//	デストラクタ
//------------------------------------------------------------
C_Under::~C_Under()
{
	OutputDebugString("destructor:C_Under\n");
}

//------------------------------------------------------------
//	描画
//------------------------------------------------------------
void C_Under::Draw()
{
	char* word;
	const int fontnum = 1; //サイズ18
	const int wordsize = 18;
	const int dispx = 0;	//描画開始位置
	
	const C_Select* sel = GET_OBJECT(const C_Select* ,C_Title::OBJ_SELECT);

	switch(sel->GetSelectStage())
	{
		case sel->SEL_START:	word = "ゲームスタートします Spase:決定 十字キー:チェンジ";	break;
		case sel->SEL_RANKING:	word = "ランキングを見ます　 Spase:決定 十字キー:チェンジ";	break;
		case sel->SEL_END:		word = "ゲームを終了します   Spase:決定 十字キー:チェンジ";	break;
	}

//	Draw_FontDrawText(dispx,WINH-wordsize,word,ARGB(255,255,255,255),fontnum,0.2f);
//	Draw_Box(0,WINH-wordsize,WINW,WINH,ARGB(100,100,100,100),ARGB(100,100,100,100),1,1,0.25f);
	//GetDraw_TpBitmap();
}

//------------------------------------------------------------
//	制御
//------------------------------------------------------------
bool C_Under::Control()
{
	return false;
}